Autodesk.Revit.DB.Lighting.PhotometricWebLightDistribution.TiltAngle
The tilt angle.
The tilt angle as a numerical value in degrees between -180.0 and 180.0.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The angle is not valid because it is not between -180.0 and 180.0.
Since:
2013

Autodesk.Revit.DB.Lighting.PhotometricWebLightDistribution.PhotometricWebFile
The filename of an IES photometric web file.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.PhotometricWebLightDistribution.#ctor(Autodesk.Revit.DB.Lighting.PhotometricWebLightDistribution)
Creates a copy of the given photometric web light distribution
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.PhotometricWebLightDistribution.#ctor(System.String,System.Double)
Creates a photometric web light distribution object with the given filename and tilt.
photometricWebFile:
The filename of the IES file to use.
tiltAngle:
The tilt angle as a numerical value in degrees between -180.0 and 180.0.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The angle is not valid because it is not between -180.0 and 180.0.
Since:
2013

Autodesk.Revit.DB.Lighting.PhotometricWebLightDistribution
This class encapsulates a photometric web light distribution.
Since:
2013